Repository: Blezz-tech/kp11-conspects
Catalog: src/src-omegat.tmx
Source language: en_us
Languages: ru_ru

source: If we have two lists, `[2,5,10]` and `[8,10,11]` and we want to get the products of all the possible combinations between numbers in those lists, here's what we'd do.
ru_ru: Если у нас есть два списка, `[2,5,10]` и `[8,10,11]`, и мы хотим получить произведения всех возможных комбинаций чисел в этих списках, вот что мы бы сделали.

source: If we prepend `2` to that, it becomes `[2,3]`, and so on.
ru_ru: Если мы добавим к этому `2`, оно станет `[2,3]` и так далее.

source: If we prepend `3` to it, it becomes `[3]`.
ru_ru: Если мы добавим к нему `3`, оно станет `[3]`.

source: If we think of a list as a monster, here's what's what.
ru_ru: Если мы думаем о списке как о монстре, то вот что есть что.

source: If we tried a list like `[1,2,'a',3,'b','c',4]`, Haskell would complain that characters (which are, by the way, denoted as a character between single quotes) are not numbers.
ru_ru: Если бы мы попробовали использовать список типа `[1,2,'a',3,'b','c',4]`, Haskell пожаловался бы, что символы (которые, кстати, обозначаются как символ между одинарными кавычками) не являются числами.

source: If we tried to do `True == 5`, GHCI would tell us that the types don't match.
ru_ru: Если бы мы попытались выполнить `True == 5`, GHCI сказал бы нам, что типы не совпадают.

source: If we try to take 0 elements, we get an empty list.
ru_ru: Если мы попытаемся взять 0 элементов, то получим пустой список.

source: If we want to have a negative number, it's always best to surround it with parentheses.
ru_ru: Если мы хотим получить отрицательное число, всегда лучше заключить его в круглые скобки.

source: If we wanted all numbers from 10 to 20 that are not 13, 15 or 19, we'd do:
ru_ru: Если бы нам нужны были все числа от 10 до 20, которые не равны 13, 15 или 19, мы бы сделали:

source: If we wanted to add one to every number that's produced in our previous function, we could have written its body like this.
ru_ru: Если бы мы хотели добавить единицу к каждому числу, полученному в нашей предыдущей функции, мы могли бы написать ее тело следующим образом.

source: If we wanted to multiply our list by 8 in an imperative language and did `doubleMe(doubleMe(doubleMe(xs)))`, it would probably pass through the list once and make a copy and then return it.
ru_ru: Если бы мы хотели умножить наш список на 8 на императивном языке и сделали `doubleMe( doubleMe( doubleMe(xs) ) )`, он, вероятно, прошел бы по списку один раз и сделал копию, а затем вернул бы ее.

source: If we wanted to write that in Haskell, we could do something like `take 10 [2,4..]`.
ru_ru: Если бы мы хотели написать это на Haskell, мы могли бы сделать что-то вроде `take 10 [2,4..]`.

source: If you change the .hs script, just run `:l myfunctions` again or do `:r`, which is equivalent because it reloads the current script.
ru_ru: Если вы измените скрипт .hs, просто снова запустите `:l myfunctions` или выполните `:r`, что эквивалентно, поскольку оно перезагружает текущий скрипт.

source: If you evaluate that by typing out `triangles` in GHCI, you'll get a list of all possible triangles with sides under or equal to 10.
ru_ru: Если вы оцените это, введя `triangles` в GHCI, вы получите список всех возможных треугольников со сторонами меньше или равными 10.

source: If you have defined some functions in a file called, say, `myfunctions.hs`, you load up those functions by typing in `:l myfunctions` and then you can play with them, provided `myfunctions.hs` is in the same folder from which `ghci` was invoked.
ru_ru: Если вы определили какие-то функции в файле с именем, скажем, `myfunctions.hs`, вы загружаете эти функции, введя `:l myfunctions`, а затем можете поиграть с ними, при условии, что `myfunctions.hs` находится в той же папке, из которой был вызван `ghci`.

source: If you just try to display the result, it will go on forever so you have to slice it off somewhere.
ru_ru: Если вы просто попытаетесь отобразить результат, он будет продолжаться вечно, так что вам придется где-то его отрезать.

source: If you say `a = 5 + 4`, you don't have to tell Haskell that `a` is a number, it can figure that out by itself.
ru_ru: Если вы говорите `a = 5 + 4`, вам не нужно говорить Haskell, что `a` - это число, он может вычислить это сам.

source: If you say that `a` is 5, you can't say it's something else later because you just said it was 5.
ru_ru: Если вы скажете, что `a` равно 5, вы не сможете позже сказать, что это что-то другое, потому что вы только что сказали, что это 5.

source: If you try to add together a number and a string, the compiler will whine at you.
ru_ru: Если вы попытаетесь сложить вместе число и строку, компилятор будет ныть на вас.

source: If you want to get an element out of a list by index, use `!!`.
ru_ru: Если вы хотите получить элемент из списка по индексу, используйте `!!`.

source: If you want to have the same prompt, just type in `:set prompt "ghci> "`.
ru_ru: Если вы хотите получить такое же приглашение, просто введите `:set prompt "ghci> "`.

source: If you're reading this, chances are you want to learn Haskell.
ru_ru: Если вы читаете это, то возможно вы хотите выучить Haskell.

source: If you're the sort of horrible person who doesn't read introductions to things and you skipped it, you might want to read the last section in the introduction anyway because it explains what you need to follow this tutorial and how we're going to load functions.
ru_ru: Если вы из тех ужасных людей, которые не читают введения к книгам, и вы пропустили его, возможно, вы все равно захотите прочитать последний раздел введения, потому что в нем объясняется, что вам нужно для выполнения этого руководства и как мы собираемся загружать функции.

source: If you've ever taken a course in mathematics, you've probably run into _set comprehensions_.
ru_ru: Если вы когда-либо проходили курс математики, вы, вероятно, сталкивались с _множествами с заданными характеристическими свойствами_^[В оригинале был термин "set comprehensions". Ссылка откуда взял: [What is Russian translation for "set comprehension"](https://russian.stackexchange.com/questions/1530/what-is-russian-translation-for-set-comprehension). И я посчитал, что второй ответ более подходящий].

source: In 2003 the Haskell Report was published, which defines a stable version of the language.
ru_ru: В 2003 году был опубликован отчет Haskell, в котором определяется стабильная версия языка.

source: In C, that would be something like `bar(bar(3))`.
ru_ru: В `C` это было бы что-то вроде `bar(bar(3))`.

source: In Haskell, functions are called by writing the function name, a space and then the parameters, separated by spaces.
ru_ru: В Haskell функции вызываются путем ввода имени функции, пробела, а затем параметров, разделенных пробелами.

source: In Haskell, lists are a **homogenous** data structure.
ru_ru: В Haskell списки представляют собой **однородную** (англ. homogenous) структуру данных.

source: In a lazy language, calling `doubleMe` on a list without forcing it to show you the result ends up in the program sort of telling you "Yeah yeah, I'll do it later!".
ru_ru: На ленивом языке вызов `doubleMe` в списке, не заставляя его показывать вам результат, приводит к тому, что программа как бы говорит вам: "Да, да, я сделаю это позже!".

source: In imperative languages you can just skip a couple of steps if the condition isn't satisfied but in Haskell every expression and function must return something.
ru_ru: В императивных языках вы можете просто пропустить пару шагов, если условие не выполнено, но в Haskell каждое выражение и функция должны что-то возвращать.

source: In imperative languages you get things done by giving the computer a sequence of tasks and then it executes them.
ru_ru: В императивных языках вы добиваетесь цели, задавая компьютеру последовательность задач, а затем он их выполняет.

source: In most imperative languages functions are called by writing the function name and then writing its parameters in parentheses, usually separated by commas.
ru_ru: В большинстве императивных языков функции вызываются путем ввода имени функции, а затем ее параметров в круглых скобках, обычно через запятую.

source: In other words, it chops off a list's head.
ru_ru: Другими словами, это отрубает голову списку.

source: In purely functional programming you don't tell the computer what to do as such but rather you tell it what stuff _is_.
ru_ru: В чисто функциональном программировании вы не указываете компьютеру, что делать как таковое, а скорее сообщаете ему, чем этот материал _является_.

source: In some ways, tuples are like lists — they are a way to store several values into a single value.
ru_ru: В некотором смысле кортежи подобны спискам — это способ хранения нескольких значений в одном значении.

source: In the previous section we got a basic feel for calling functions.
ru_ru: В предыдущем разделе мы получили базовое представление о вызове функций.

source: In this section we'll look at the basics of lists, strings (which are lists) and list comprehensions.
ru_ru: В этом разделе мы рассмотрим основы списков, строк (которые являются списками) и понимания списков.

source: Instead of surrounding the vectors with square brackets, we use parentheses: `[(1,2),(8,11),(4,5)]`.
ru_ru: Вместо того чтобы заключать векторы в квадратные скобки, мы используем круглые скобки: `[(1,2),(8,11),(4,5)]`.

source: Instead, we'll use ranges.
ru_ru: Вместо этого мы будем использовать диапазоны.

source: Interactively.
ru_ru: Интерактивно.

source: It all blows up in our face!
ru_ru: Все это взрывается нам в лицо!

source: It also allows cool things such as infinite data structures.
ru_ru: Это также позволяет создавать интересные вещи, такие как бесконечные структуры данных.

source: It doesn't really make much sense when you think about it.
ru_ru: На самом деле это не имеет особого смысла, когда ты думаешь об этом.

source: It extracts that many elements from the beginning of the list.
ru_ru: Он извлекает некоторое количество элементов из начала списка.

source: It forces you to think differently, which brings us to the next section …
ru_ru: Это заставляет вас думать по-другому, что подводит нас к следующему разделу ...

source: It means that we first call the function `bar` with `3` as the parameter to get some number and then we call `bar` again with that number.
ru_ru: Это означает, что мы сначала вызываем функцию `bar` с `3` в качестве параметра, чтобы получить некоторое число, а затем мы снова вызываем `bar` с этим числом.

source: It pairs up the elements and produces a new list.
ru_ru: Он объединяет элементы в пары и создает новый список.

source: It says that the character will be included in the new list only if it's an element of the list `['A'..'Z']`.
ru_ru: В нем говорится, что символ будет включен в новый список, только если он является элементом списка `['A'..'Z']`.

source: It stores several elements of the same type.
ru_ru: В нем хранится несколько элементов одного и того же типа.

source: It takes two lists and then zips them together into one list by joining the matching elements into pairs.
ru_ru: Он берет два списка, а затем объединяет их в один список, объединяя совпадающие элементы в пары.

source: It'll wait to see what you want to get out of that infinite lists.
ru_ru: Это подождет, чтобы увидеть, что вы хотите получить из этих бесконечных списков.

source: It's a really simple function but it has loads of uses.
ru_ru: Это действительно простая функция, но у нее множество применений.

source: It's a valid character to use in a function name.
ru_ru: Это допустимый символ для использования в имени функции.

source: It's especially useful for when you want to combine two lists in a way or traverse two lists simultaneously.
ru_ru: Это особенно полезно, когда вы хотите каким-то образом объединить два списка или одновременно просматривать два списка.

source: It's like cycling a list with only one element.
ru_ru: Это все равно что перебирать список, содержащий только один элемент.

source: It's simply a matter of separating the first two elements with a comma and then specifying what the upper limit is.
ru_ru: Это просто вопрос разделения первых двух элементов запятой, а затем указания верхнего предела.

source: It's telling us that we tried to use a pair and a triple in the same list, which is not supposed to happen.
ru_ru: Это говорит нам о том, что мы пытались использовать пару и тройку в одном списке, чего не должно было произойти.

source: It's the most used data structure and it can be used in a multitude of different ways to model and solve a whole bunch of problems.
ru_ru: Это наиболее используемая структура данных, и ее можно использовать множеством различных способов для моделирования и решения целого ряда проблем.

source: It's usually called as an infix function because it's easier to read that way.
ru_ru: Обычно она вызывается как инфиксная функция, потому что так ее легче читать.

source: Just a friendly reminder: because strings are lists, we can use list comprehensions to process and produce strings.
ru_ru: Просто дружеское напоминание: поскольку строки являются списками, мы можем использовать списковое включение для обработки и создания строк.

source: Just like you can't have a list that has some characters and some numbers, you can't have a list that has some lists of characters and some lists of numbers.
ru_ru: Точно так же, как у вас не может быть списка, содержащего некоторые символы и некоторые цифры, у вас не может быть списка, содержащего некоторые списки символов и некоторые списки чисел.

source: Later we'll go into more detail on infinite lists.
ru_ru: Позже мы более подробно остановимся на бесконечных списках.

source: Learning Haskell is much like learning to program for the first time — it's fun!
ru_ru: Изучение Haskell во многом похоже на обучение программированию в первый раз — это весело!

source: Let's make a function that takes two numbers and multiplies each by two and then adds them together.
ru_ru: Давайте создадим функцию, которая принимает два числа и умножает каждое на два, а затем складывает их вместе.

source: Let's remove all odd numbers without flattening the list.
ru_ru: Давайте удалим все нечетные числа, не выравнивая список.

source: Let's say we want a comprehension that replaces each odd number greater than 10 with `"BANG!"` and each odd number that's less than 10 with `"BOOM!"`.
ru_ru: Допустим, нам нужно списковое включение, которое заменяет каждое нечетное число, большее 10, на `"BANG!"`, а каждое нечетное число, меньшее 10, на `"BOOM!"`.

source: Let's say we want only the elements which, doubled, are greater than or equal to 12.
ru_ru: Допустим, нам нужны только те элементы, которые в удвоенном виде больше или равны 12.

source: Let's take a look at them.
ru_ru: Давайте взглянем на них.

source: Let's write our own version of `length`!
ru_ru: Давайте напишем нашу собственную версию `длины`!

source: Like lists, tuples can be compared with each other if their components can be compared.
ru_ru: Как и списки, кортежи можно сравнивать друг с другом, если можно сравнить их компоненты.

source: Like we said, spaces are used for function application in Haskell.
ru_ru: Как мы уже говорили, пробелы используются для применения функций в Haskell.

source: List comprehensions are very similar to set comprehensions.
ru_ru: Списковое включение очень похоже на понимание набора.

source: Lists are SO awesome.
ru_ru: Списки - это ТАК здорово.

source: Lists can also contain lists.
ru_ru: Списки также могут содержать списки.

source: Lists can be compared if the stuff they contain can be compared.
ru_ru: Списки можно сравнивать, если можно сравнить содержащийся в них материал.

source: Lots of people who come from imperative languages tend to stick to the notion that parentheses should denote function application.
ru_ru: Многие люди, пришедшие из императивных языков, склонны придерживаться представления о том, что круглые скобки должны обозначать применение функции.

source: Making basic functions that are obviously correct and then combining them into more complex functions.
ru_ru: Создание базовых функций, которые, очевидно, являются правильными, а затем объединение их в более сложные функции.

source: Most functions that aren't used with numbers are _prefix_ functions.
ru_ru: Большинство функций, которые не используются с числами, являются _префиксными_ функциями.

source: Much like shopping lists in the real world, lists in Haskell are very useful.
ru_ru: Подобно спискам покупок в реальном мире, списки в Haskell очень полезны.

source: My advice is not to use them in list ranges.
ru_ru: Мой совет - не использовать их в диапазонах списков.

source: Nested list comprehensions are also possible if you're operating on lists that contain lists.
ru_ru: Вложенное списковое включение также возможно, если вы работаете со списками, которые содержат списки.

source: Next, we'll add a condition that they all have to be right triangles.
ru_ru: Далее мы добавим условие, что все они должны быть прямоугольными треугольниками.

source: Not only can we have multiple predicates in list comprehensions (an element must satisfy all the predicates to be included in the resulting list), we can also draw from several lists.
ru_ru: Мы не только можем иметь несколько предикатов в списковом включении (элемент должен удовлетворять всем предикатам, которые будут включены в результирующий список), мы также можем извлекать данные из нескольких списков.

source: Note that weeding out lists by predicates is also called **filtering**.
ru_ru: Обратите внимание, что отсеивание списков по предикатам также называется **фильтрацией** (англ. filtering).

source: Note the `'` at the end of the function name.
ru_ru: Обратите внимание на `'` в конце имени функции.

source: Note: you can do `5 + 4.0` because `5` is sneaky and can act like an integer or a floating-point number.
ru_ru: > Примечание: вы можете использовать `5 + 4.0`, потому что `5` является скрытым и может действовать как целое число или число с плавающей запятой.

source: Notice how `:` takes a number and a list of numbers or a character and a list of characters, whereas `++` takes two lists.
ru_ru: Обратите внимание, как `:` принимает число и список чисел или символ и список символов, тогда как `++` принимает два списка.

source: Notice that because pairs can have different types in them, `zip` can take two lists that contain different types and zip them up.
ru_ru: Обратите внимание, что, поскольку пары могут содержать разные типы, `zip` может взять два списка, содержащих разные типы, и объединить их.

source: Now for another example.
ru_ru: Теперь перейдем к другому примеру.

source: Now let's add a condition (or a predicate) to that comprehension.
ru_ru: Теперь давайте добавим условие (или предикат) к этому списковому включению.

source: Now let's try making our own!
ru_ru: Теперь давайте попробуем сделать нашу собственную функцию!

source: Now navigate to where it's saved and run `ghci` from there.
ru_ru: Теперь перейдите туда, где он сохранен, и запустите `ghci` оттуда.

source: Now that our script is loaded, we can play with the function that we defined.
ru_ru: Теперь, когда наш скрипт загружен, мы можем поиграть с функцией, которую мы определили.

source: Now we're going to make a function that multiplies a number by 2 but only if that number is smaller than or equal to 100 because numbers bigger than 100 are big enough as it is!
ru_ru: Теперь мы собираемся создать функцию, которая умножает число на 2, но только если это число меньше или равно 100, потому что числа больше 100 и так достаточно велики!

source: Now, we just modify the function by saying that we want the ones where the perimeter is 24.
ru_ru: Теперь мы просто модифицируем функцию, сказав, что нам нужны те, у которых периметр равен 24.

source: Numbers can be enumerated.
ru_ru: Числа можно перечислять.

source: Oh my!
ru_ru: О боже!

source: Once inside GHCI, do `:l baby`.
ru_ru: Оказавшись внутри GHCI, выполните `:l baby`.

source: One way would be to use a list.
ru_ru: Одним из способов было бы использовать список.

source: One, two, three, four, etc.
ru_ru: Один, два, три, четыре и так далее.

source: Only you can't compare two tuples of different sizes, whereas you can compare two lists of different sizes.
ru_ru: Только вы не можете сравнить два кортежа разных размеров, в то время как вы можете сравнить два списка разных размеров.

source: Open up your favorite text editor and punch in this function that takes a number and multiplies it by two.
ru_ru: Откройте свой любимый текстовый редактор и введите эту функцию, которая принимает число и умножает его на два.

source: Open your terminal and type in `ghci`.
ru_ru: Откройте свой терминал и введите `ghci`.

source: Or every third number between 1 and 20?
ru_ru: Или каждое третье число от 1 до 20?

source: People there are extremely nice, patient and understanding to newbies.
ru_ru: Люди там чрезвычайно милы, терпеливы и с пониманием относятся к новичкам.

source: Predicates go after the binding parts and are separated from them by a comma.
ru_ru: Предикаты идут после связующих частей и отделяются от них запятой.

source: Pretty cool, huh?
ru_ru: Довольно круто, да?

source: Ranges are a way of making lists that are arithmetic sequences of elements that can be enumerated.
ru_ru: Диапазоны - это способ создания списков, представляющих собой арифметические последовательности элементов, которые можно перечислять.

source: Ranges are cool because you can also specify a step.
ru_ru: Диапазоны хороши тем, что вы также можете указать шаг.

source: Right here we introduced Haskell's if statement.
ru_ru: Прямо здесь мы представили оператор `if`.

source: Save this as `baby.hs` or something.
ru_ru: Сохраните это как "baby.hs" или что-то в этом роде.

source: Say you have an immutable list of numbers `xs = [1,2,3,4,5,6,7,8]` and a function `doubleMe` which multiplies every element by 2 and then returns a new list.
ru_ru: Допустим, у вас есть неизменяемый список чисел `xs = [1,2,3,4,5,6,7,8]` и функция `doubleMe`, которая умножает каждый элемент на 2, а затем возвращает новый список.

source: See for yourself:
ru_ru: Смотрите сами:

source: See how if we try to take more elements than there are in the list, it just returns the list.
ru_ru: Посмотрите, как если мы попытаемся взять больше элементов, чем есть в списке, это просто вернет список.

source: Simple.
ru_ru: Просто.

source: So 100.
ru_ru: Итак, 100.

source: So if you see something like `bar (bar 3)`, it doesn't mean that `bar` is called with `bar` and `3` as parameters.
ru_ru: Поэтому, если вы видите что-то вроде `bar (bar 3)`, это не означает, что `bar` вызывается с `bar` и `3` в качестве параметров.

source: So if you're not in GHCI, it's better to split longer list comprehensions across multiple lines, especially if they're nested.
ru_ru: Поэтому, если вы не используете GHCI, лучше разделить более длинные списковые включения на несколько строк, особенно если они вложены.

source: So in purely functional languages, a function has no side-effects.
ru_ru: Таким образом, в чисто функциональных языках функция не имеет побочных эффектов.

source: So it only does one pass through the list and only when you really need it.
ru_ru: Таким образом, он выполняет только один проход по списку и только тогда, когда вам это действительно нужно.

source: So this is an attempt at adding another useful resource for learning Haskell so you have a bigger chance of finding one you like.
ru_ru: Итак, это попытка добавить еще один полезный ресурс для изучения Haskell, чтобы у вас было больше шансов найти тот, который вам понравится.

source: So those functions in Haskell would be `foo`, `bar 1` and `baz 3 "haha"`.
ru_ru: Таким образом, этими функциями в Haskell были бы `foo`, `bar 1` и `baz 3 "ха-ха"`.
